In [4]:
import numpy as np
def function():
    mylist= [1,2,3,4,5,6,7,8]
    addittoarray = np.array(mylist)
function()

In [5]:
addittoarray

array([1, 2, 3, 4, 5, 6, 7, 8])

In [209]:
myarrays = [addittoarray , addittoarray, addittoarray]

In [210]:
nump = np.array(myarrays)

In [211]:
nump

array([[1, 2, 3, 4, 5, 6, 7, 8],
       [1, 2, 3, 4, 5, 6, 7, 8],
       [1, 2, 3, 4, 5, 6, 7, 8]])

In [57]:
class Book():
    def __init__(Events,clients,parties):
        Events.clients = clients
        Events.parties = parties
makebooking = Book(clients = "Dataprophet",parties = "Birthday Parties")

In [63]:
print(makebooking.clients + " " + makebooking.parties)

Dataprophet Birthday Parties

In [90]:
def Say_hello(name):
    print("yo")
    print(f'yo {name}')
Say_hello("bill")

def addanumber(number1,number2):
    return (number1 + number2 ) * 100
resultsare = addanumber(494,594)

yo
yo bill

In [91]:
resultsare

108800

In [131]:
# stock market prices excersie



class mySample:
    def __init__(self,stock_prices):
        self.stock_prices = stock_prices
    def function(self):
        stock_prices = dict([('APPL',200),('GOOG',150),('GBP',300)])
        return stock_prices
    for stock_item in stock_prices:
        print("the dict stock item is : {}".format(stock_prices) + " " + "the function dict is :{}".format(getsample.stock_prices))
getsample = mySample(stock_prices)

the dict stock item is : [{'APPL': 150, 'GOOG': 200, 'GBP': 100}] the function dict is :[{'APPL': 150, 'GOOG': 200, 'GBP': 100}]

In [153]:
for ticker,price,default in getsample.stock_prices:
    print(price , " ",default, " ", ticker)

GOOG   GBP   APPL

In [177]:
def samplefunc():
    row1 = getsample.stock_prices[0]['APPL']
    row2 = getsample.stock_prices[0]['GOOG']
    row3 = getsample.stock_prices[0]['GBP']
    row_result = row1,row2,row3
samplefunc()

In [181]:
row_result
set(row_result)

{100, 150, 200}

In [207]:
# change the prices 

getsample.stock_prices[0]['APPL'] = 667

In [208]:
getsample.stock_prices

[{'APPL': 667, 'GOOG': 200, 'GBP': 100}]

In [251]:
mlist = [1,2,3,4,5]
tlist = [33,776,432,24]
result = [mlist,tlist]
print(np.array(result))

[list([1, 2, 3, 4, 5]) list([33, 776, 432, 24])]

In [282]:
# Pandas Series
#Pandas Libaries

#  Python Example Project 
import pandas as pd
from pandas import Series,DataFrame

def titanicData():
    read_titanic = pd.read_csv('train.csv')
    for objects in read_titanic:
        print([objects,[objects]])
        
titanic_data = pd.read_csv('train.csv')
print(titanic_data)
       
titanicData()

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
['PassengerId', ['PassengerId']]
['Survived', ['Survived']]
['Pclass', ['Pclass']]
['Name', ['Name']]
['Sex', ['Sex']]
['Age', ['Age']]
['SibSp', ['SibSp']]
['Parch', ['Parch']]
['Ticket', ['Ticket']]
['Fare', ['Fare']]
['Cabin', ['Cabin']]
['Embarked', ['Embarked']]

In [285]:
titanic_data = pd.read_csv('train.csv')

In [289]:
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [291]:
# Arranging the data in order.

set(titanic_data.head())

{'Age',
 'Cabin',
 'Embarked',
 'Fare',
 'Name',
 'Parch',
 'PassengerId',
 'Pclass',
 'Sex',
 'SibSp',
 'Survived',
 'Ticket'}

In [294]:

#collecting the head of the data(first-top-section)
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [295]:
# Collect the information on the current data.
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [328]:
# Basic Questions About the data.
#1. who were the passengers on the Titanic?
pd.DataFrame(titanic_data["Name"])

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

In [346]:
print(titanic_data["Name"][0],titanic_data["Age"][0],"Sex Gender is of:" + titanic_data["Sex"][0])

Braund, Mr. Owen Harris 22.0 Sex Gender is of:male